network-tests/v1/oha-results/s3-bucket/cilium-service-mesh-poc-pod-tests/test-pod-172.20.73.171-16-500.txt
Started at 2024-03-22-12-03
Summary:
  Success rate:	100.00%
  Total:	180.0009 secs
  Slowest:	1.0241 secs
  Fastest:	0.0015 secs
  Average:	0.0019 secs
  Requests/sec:	499.9975

  Total data:	6.87 MiB
  Size/request:	80
  Size/sec:	39.06 KiB

Response time histogram:
  0.001 [1]     |
  0.104 [89995] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.206 [0]     |
  0.308 [0]     |
  0.411 [0]     |
  0.513 [0]     |
  0.615 [0]     |
  0.717 [0]     |
  0.820 [0]     |
  0.922 [0]     |
  1.024 [4]     |

Response time distribution:
  10.00% in 0.0016 secs
  25.00% in 0.0017 secs
  50.00% in 0.0017 secs
  75.00% in 0.0018 secs
  90.00% in 0.0019 secs
  95.00% in 0.0021 secs
  99.00% in 0.0054 secs
  99.90% in 0.0131 secs
  99.99% in 0.0236 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.0007 secs, 1.0228 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0039 secs

Status code distribution:
  [200] 90000 responses
Finished at 2024-03-22-12-06